Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.StraightEndSymbolTypes Enumeration
 The available straight end symbol types. See Tekla Structures help, "Reinforcement appearance", for more information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum StraightEndSymbolTypes
Public Enumeration StraightEndSymbolTypes
Members
Member name | Value | Description
NoSymbol | 1 | No straight end symbol.
HooksOnInnerSide | 2 | Draws half hooks on the reinforcement's inner side.
HooksOnOuterSide | 3 | Draws half hooks on the reinforcement's outer side.
HookOnReinforcementStartOuterSide | 4 |  Draws a half hook on the reinforcement's outer side in the reinforcement's start point, and another half hook on the inner side in the end point.
HookOnReinforcementStartInnerSide | 5 |  Draws a half hook on the reinforcement's inner side in the reinforcement's start point, and another half hook on the outer side in the end point.
FullHooks | 6 | Draws full hooks in the reinforcement's end points.
See Also
Reference
Tekla.Structures.Drawing Namespace